BaseConfiguration/Money_2_0/Catalogs/ГрафыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГрафыБюджета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДляФинансовыхЦелей</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСвободныхДенег</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКНакоплениям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ТипыБюджетныхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыБюджетныхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ГрафыБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устаналивает значения по умолчанию для реквизитов предопределенных элементов справочника
//	
Процедура ОбновитьРеквизитыПредопределенныхЭлементов() Экспорт
	
	// Справочник "ГрафыБюджета" используется для упорядочивания статей бюджета.
	//	Предопределенные элементы должны по умолчанию иметь однозначные коды, т.к. именно по ним 
	//	сворачиваются показатели бюджета.
	
	
	// Доходы:
	ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Поступление;
	
	// "Прочие доходы" имеет код "10." - корень для всех планируемых поступлений
	//	Если для бюджетной статьи дохода не найдется родителя с более длинным кодом, 
	//	такая статья автоматически попадет в "Прочие доходы"
	//Графа = Справочники.ГрафыБюджета.ПрочиеДоходы.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПрочиеДоходы", НСтр("ru = 'Другие доходы'"));
	Графа.Наименование = НСтр("ru = 'Другие доходы'");
	Графа.Код                      = "10.99.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 9999;
	Графа.ТипСтатьи                = "ВсеДоходы";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.Доходы.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("Доходы", НСтр("ru = 'Доходы по статьям'"));
	Графа.Наименование = НСтр("ru = 'Доходы по статьям'");
	Графа.Код                      = "10.1.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "СтатьяДоходов";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
	// Только для свободных денег: возврат из накоплений в свободные деньги
//	Графа = Справочники.ГрафыБюджета.СвободныеДеньгиВозвратИзНакопления.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("СвободныеДеньгиВозвратИзНакопления", НСтр("ru = 'Перевод из накоплений'"));
	Графа.Наименование = НСтр("ru = 'Перевод из накоплений'");
	Графа.Код                      = "10.2.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Ложь;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1200;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = -1;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
//	Графа = Справочники.ГрафыБюджета.ИспользованиеКредитнойКарты.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ИспользованиеКредитнойКарты", НСтр("ru = 'Использование кредитных карт'"));
	Графа.Наименование = НСтр("ru = 'Использование кредитных карт'");
	Графа.Код                      = "10.3.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1300;
	Графа.ТипСтатьи                = "КредитнаяКарта";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.ПолучениеКредита.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПолучениеКредита", НСтр("ru = 'Получение кредитов, займов'"));
	Графа.Наименование = НСтр("ru = 'Получение кредитов, займов'");
	Графа.Код                      = "10.4.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1400;
	Графа.ТипСтатьи                = "НашДолг";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.ВозвратВыданногоЗайма.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ВозвратВыданногоЗайма", НСтр("ru = 'Возврат от должников'"));
	Графа.Наименование = НСтр("ru = 'Возврат от должников'");
	Графа.Код                      = "10.5.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1500;
	Графа.ТипСтатьи                = "ДолгНам";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.ВыручкаЗаИмущество.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ВыручкаЗаИмущество", НСтр("ru = 'Продажа имущества'"));
	Графа.Наименование = НСтр("ru = 'Продажа имущества'");
	Графа.Код                      = "10.6.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1600;
	Графа.ТипСтатьи                = "Имущество";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
	
	// Только для накоплений: поревод в накопление на фин.цель из св. денег или др. накоплений
//	Графа = Справочники.ГрафыБюджета.ФинЦельПереводВНакопление.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ФинЦельПереводВНакопление", НСтр("ru = 'Поступления из свободных денег или др. фин.целей'"));
	Графа.Наименование = НСтр("ru = 'Поступления из свободных денег или др. фин.целей'");
	Графа.Код                      = "10.7.";
	Графа.ДляСвободныхДенег        = Ложь;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = 1;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
	
	// Рахсоды
	ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Списание;
	
	// "Прочие расходы" имеет код "20." - корень для всех планируемых списаний.
	//	Если для бюджетной статьи расходв не найдется родителя с более длинным кодом, 
	//	такая статья автоматически попадет в "Прочие расходы"
//	Графа = Справочники.ГрафыБюджета.ПрочиеРасходы.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПрочиеРасходы", НСтр("ru = 'Другие расходы'"));
	Графа.Наименование = НСтр("ru = 'Другие расходы'");
	Графа.Код                      = "20.99.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 9999;
	Графа.ТипСтатьи                = "ВсеРасходы";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.Расходы.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("Расходы", НСтр("ru = 'Расходы по статьям'"));
	Графа.Наименование = НСтр("ru = 'Расходы по статьям'");
	Графа.Код                      = "20.1.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "СтатьяРасходов";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	// Только для свободных денег: перевод в накопления
//	Графа = Справочники.ГрафыБюджета.СвободныеДеньгиПереводВНакопление.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("СвободныеДеньгиПереводВНакопление", НСтр("ru = 'Перевод в накопления'"));
	Графа.Наименование = НСтр("ru = 'Перевод в накопления'");
	Графа.Код                      = "20.2.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Ложь;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1200;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = -1;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
//	Графа = Справочники.ГрафыБюджета.ПереводНаКредитнуюКарту.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПереводНаКредитнуюКарту", НСтр("ru = 'Пополнение кредитных карт'"));
	Графа.Наименование = НСтр("ru = 'Пополнение кредитных карт'");
	Графа.Код                      = "20.3.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1300;
	Графа.ТипСтатьи                = "КредитнаяКарта";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.ПогашениеКредита.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПогашениеКредита", НСтр("ru = 'Погашение кредитов, займов'"));
	Графа.Наименование = НСтр("ru = 'Погашение кредитов, займов'");
	Графа.Код                      = "20.4.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1400;
	Графа.ТипСтатьи                = "НашДолг";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
//	Графа = Справочники.ГрафыБюджета.ВыдачаВзаймы.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ВыдачаВзаймы", НСтр("ru = 'Выдача в долг'"));
	Графа.Наименование = НСтр("ru = 'Выдача в долг'");
	Графа.Код                      = "20.5.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1500;
	Графа.ТипСтатьи                = "ДолгНам";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
//	Графа = Справочники.ГрафыБюджета.ПокупкаИмущества.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ПокупкаИмущества", НСтр("ru = 'Покупка имущества'"));
	Графа.Наименование = НСтр("ru = 'Покупка имущества'");
	Графа.Код                      = "20.6.";
	Графа.ДляСвободныхДенег        = Истина;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1600;
	Графа.ТипСтатьи                = "Имущество";
	Графа.ОтношениеКНакоплениям    = 0;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
	
	// Только для накоплений: перевод из накоплений в свободные деньги или на другую фин.цель
//	Графа = Справочники.ГрафыБюджета.ФинЦельВозвратИзНакопления.ПолучитьОбъект();
	Графа = ОбъектПредопределенногоЭлемента("ФинЦельВозвратИзНакопления", НСтр("ru = 'Перевод в св. деньги или на другую фин.цель'"));
	Графа.Наименование = НСтр("ru = 'Перевод в св. деньги или на другую фин.цель'");
	Графа.Код                      = "20.7.";
	Графа.ДляСвободныхДенег        = Ложь;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1150;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = 1;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(Графа);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Тогда
		// на сервере - только для неразделенного режима
		Возврат;
	КонецЕсли;
	
	ОбновитьРеквизитыПредопределенныхЭлементов();
	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныйФункционал

Функция ОбъектПредопределенногоЭлемента(ИмяПредопределенного, Наименование)
	
	Ссылка = ОбслуживаниеСправочников.ПровереннаяСсылкаПредопределенного(Справочники.ГрафыБюджета, 
			ИмяПредопределенного, 
			Наименование, 
			Ложь, 
			Неопределено);
			
	Возврат Ссылка.ПолучитьОбъект();
	
КонецФункции

#КонецОбласти


#КонецЕсли
